alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- RGB LED (active LOW, common anode to 3.3V) ---
#define LED_R_PIN       4
#define LED_G_PIN      16
#define LED_B_PIN      17
#define LED_R_CH        0   // LEDC channels
#define LED_G_CH        1
#define LED_B_CH        2

// --- Screen dimensions ---
#define SCREEN_W        320
#define SCREEN_H        240
//#define ROTATE_180          // uncomment to rotate display 180° (USB on left)

// --- Layout (KB shown) ---
#define HIST_Y_TOP      0
#define HIST_H_KB_SHOW  116
#define IBAR_Y_KB_SHOW  116
#define IBAR_H_KB_SHOW   20
#define KB_Y            136
#define KB_H            104

// --- Layout (KB hidden) ---
#define HIST_H_KB_HIDE  220
#define IBAR_Y_KB_HIDE  220
#define IBAR_H_KB_HIDE   20

// --- Colours ---
#define COL_BG          TFT_BLACK
#define COL_USER        TFT_CYAN
#define COL_AI          TFT_YELLOW
#define COL_ERROR       TFT_RED
#define COL_KEY_FACE    0x4208   // dark grey
#define COL_KEY_LABEL   TFT_WHITE
#define COL_IBAR_BG     0x2104   // very dark grey
#define COL_IBAR_TEXT   TFT_WHITE
#define COL_BTN_BG      0x2945   // mid grey
#define COL_BTN_TEXT    TFT_WHITE

// --- Objects ---
TFT_eSPI tft = TFT_eSPI();
SPIClass touchSPI(HSPI);
XPT2046_Touchscreen ts(TOUCH_CS_PIN, TOUCH_IRQ);

// --- Keyboard layout ---
bool kbVisible = true;
bool shiftOn   = false;   // starts lowercase
bool altOn     = false;   // alt layer off by default

const char* KB_ROW1          = "QWERTYUIOP";
const char* KB_ROW2          = "ASDFGHJKL";
const char* KB_ROW3          = "ZXCVBNM";
const char* KB_NUM_UNSHIFTED = "1234567890";
const char* KB_NUM_SHIFTED   = "!@#$%^&*()";

// Alt layer for number row
const char* KB_NUM_ALT_TYPED[10] = { "|", "\"", ":", "{", "}", "'", "@", "-", "+", "=" };
const char* KB_NUM_ALT_DISP[10]  = { "|", "\"", ":", "{", "}", "'", "@", "-", "+", "=" };

#define KEY_W       32
#define KEY_H       20
#define KEY_GAP      1
#define KB_ROW1_X    0   // all rows flush left — 10 × 32 = 320px
#define KB_ROW2_X    0
#define KB_ROW3_X    0

// Row 4 special key widths and positions
// [Shift 40]+[Alt 40]+[Space 166]+[Hide 42] + tall BS (26×45) at bottom-right
// Hide RHS=288 aligns with '.' key RHS; BS starts at 294 (gap of 6px after Hide)
#define BS_W        26   // ~20% thinner than KEY_W=32
#define BS_X       294   // bottom right (SCREEN_W - BS_W)
#define BS_H        40   // tall delete key; drawn from (SCREEN_H - BS_H) upward
#define SHIFT_W     40
#define SHIFT_X      0
#define ALT_W       40
#define ALT_X       40   // SHIFT_X + SHIFT_W
#define SPACE_W    166   // HIDE_X(246) - SPACE_X(80)
#define SPACE_X     80   // ALT_X + ALT_W
#define HIDE_W      42
#define HIDE_X     246   // SPACE_X + SPACE_W; RHS=288 = '.' key RHS

// --- Key appearance ---
#define KEY_RADIUS        3     // rounded corner radius for keys

// --- Layout metrics ---
#define LINE_H_LARGE     15     // DejaVuSansBold12px line height (yAdvance=15)
#define LINE_H_SMALL     10     // GLCD line height (8px + 2px gap)
#define SPLASH_H         45     // height of boot splash area to clear after connect (3 × LINE_H_LARGE)

// --- Input bar ---
#define INPUT_BUF_SIZE  128     // input text buffer including null terminator
#define INPUT_MAX_LEN   127     // max typeable characters (INPUT_BUF_SIZE - 1)
#define BTN_SEND_W       46     // width of Send/More button
#define BTN_SEND_X_TEXT  39     // distance of Send/More text from right edge
#define BTN_SHOWKB_W     58     // width of Show KB button
#define BTN_SHOWKB_X    110     // distance of Show KB button left edge from right
#define BTN_INSET         2     // pixel inset for button fill within input bar

// --- Timing ---
#define WIFI_MAX_ATTEMPTS    30    // max retries waiting for WiFi (× WIFI_RETRY_DELAY_MS)
#define WIFI_RETRY_DELAY_MS 500    // ms between WiFi connect retries
#define KEY_FLASH_MS        100    // key highlight flash duration on tap
#define API_TIMEOUT_MS    45000    // API response deadline ms
#define API_WAIT_FIRST_MS  4000    // ms before first waiting message appears

// --- WiFi RSSI thresholds for LED colour ---
#define RSSI_THRESH_BLUE   -55    // ≥ this dBm → blue (strongest)
#define RSSI_THRESH_CYAN   -65    // ≥ this dBm → cyan (good)
#define RSSI_THRESH_GREEN  -75    // ≥ this dBm → green (fair)

// --- LED PWM ---
#define LED_PWM_FREQ     5000    // LEDC PWM frequency Hz
#define LED_PWM_BITS        8    // LEDC resolution bits

// --- API ---
#define HTTPS_PORT        443
#define GEMINI_HOST       "generativelanguage.googleapis.com"
#define GROK_HOST         "eu-west-1.api.x.ai"
#define GROK_MODEL        "grok-4-1-fast-reasoning"
#define GROQ_HOST         "api.groq.com"
#define GROQ_MODEL        "openai/gpt-oss-120b"

void drawKey(int x, int y, int w, int h, const char* label, uint16_t face, uint16_t text) {
    tft.fillRoundRect(x, y, w - 1, h, KEY_RADIUS, face);
    tft.setTextColor(text, face);
    tft.setFreeFont(&DejaVuSansBold12px);
    int tx = x + (w - (int)tft.textWidth(label)) / 2;
    int ty = y + (h - 15) / 2 + 1;   // 15 = yAdvance; +1 lowers text slightly
    tft.drawString(label, tx, ty);
    tft.setTextFont(1);           // restore GLCD for everything else
}

void drawKeyboard() {
    if (!kbVisible) return;
    tft.fillRect(0, KB_Y, SCREEN_W, KB_H, COL_BG);
    int rowStep = KEY_H + KEY_GAP;
    int x;

    // Row 0: number / symbol / alt keys
    x = 0;
    for (int i = 0; i < 10; i++) {
        if (altOn) {
            drawKey(x, KB_Y, KEY_W, KEY_H, KB_NUM_ALT_DISP[i], COL_KEY_FACE, COL_KEY_LABEL);
        } else {
            char label[2] = { shiftOn ? KB_NUM_SHIFTED[i] : KB_NUM_UNSHIFTED[i], 0 };
            drawKey(x, KB_Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        }
        x += KEY_W;
    }

    // Row 1: QWERTY (centred, no Hide button)
    x = 0;
    int row1Y = KB_Y + rowStep;
    for (int i = 0; i < 10; i++) {
        char c = shiftOn ? KB_ROW1[i] : (KB_ROW1[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row1Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }

    // Row 2: ASDFGHJKL + /
    x = 0;
    int row2Y = KB_Y + 2 * rowStep;
    for (int i = 0; i < 9; i++) {
        char c = shiftOn ? KB_ROW2[i] : (KB_ROW2[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row2Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }
    drawKey(x, row2Y, KEY_W, KEY_H, altOn ? "\\" : (shiftOn ? "?" : "/"), COL_KEY_FACE, COL_KEY_LABEL);

    // Row 3: ZXCVBNM + , .
    x = 0;
    int row3Y = KB_Y + 3 * rowStep;
    for (int i = 0; i < 7; i++) {
        char c = shiftOn ? KB_ROW3[i] : (KB_ROW3[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row3Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }
    drawKey(x, row3Y, KEY_W, KEY_H, altOn ? "[" : (shiftOn ? "<" : ","), COL_KEY_FACE, COL_KEY_LABEL); x += KEY_W;
    drawKey(x, row3Y, KEY_W, KEY_H, altOn ? "]" : (shiftOn ? ">" : "."), COL_KEY_FACE, COL_KEY_LABEL);

    // Row 4: tall BS at bottom-left + [Shift] [Alt] [Space] [Hide]
    int row4Y = KB_Y + 4 * rowStep + 1;
    int bsY   = SCREEN_H - BS_H;
    uint16_t shiftFace = shiftOn ? TFT_NAVY : COL_BTN_BG;
    uint16_t altFace   = altOn   ? TFT_NAVY : COL_BTN_BG;
    drawKey(BS_X,    bsY,   BS_W,    BS_H,      "<-",    COL_BTN_BG, COL_BTN_TEXT);
    drawKey(SHIFT_X, row4Y, SHIFT_W, KEY_H - 1, shiftOn ? "SHF" : "shf", shiftFace, COL_BTN_TEXT);
    drawKey(ALT_X,   row4Y, ALT_W,   KEY_H - 1, altOn   ? "ALT" : "alt", altFace,   COL_BTN_TEXT);
    drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", COL_BTN_BG, COL_BTN_TEXT);
    drawKey(HIDE_X,  row4Y, HIDE_W,  KEY_H - 1, "Hide",  COL_BTN_BG, COL_BTN_TEXT);
}

