alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    if (largeFont) tft.setFreeFont(&DejaVuSansBold12px); else tft.setTextSize(1);
    tft.setTextWrap(false);  // prevent overflow wrapping onto adjacent lines
    for (int i = 0; i < maxVis && (firstIdx + i) < lineCount; i++) {
        int idx = firstIdx + i;
        uint16_t col = lineColor[idx];
        if (invertDisplay) col = TFT_BLACK;
        tft.setTextColor(col, bg);
        if (largeFont) tft.drawString(lines[idx], 0, i * lineH);
        else { tft.setCursor(0, i * lineH); tft.print(lines[idx]); }
    }
    tft.setTextWrap(true);
    tft.setTextFont(1);  // restore GLCD for everything else
}

void addMessage(bool isUser, bool isError, const char* text) {
    if (historyCount >= MAX_MESSAGES) {
        // Drop oldest two (user+AI pair)
        memmove(history, history + 2, (MAX_MESSAGES - 2) * sizeof(Message));
        historyCount -= 2;
    }
    history[historyCount].isUser  = isUser;
    history[historyCount].isError = isError;
    strncpy(history[historyCount].text, text, 2047);
    history[historyCount].text[2047] = '\0';
    // Sanitise to printable ASCII (32-126). Multi-char replacements use a temp
    // buffer because some strings ("Sterling") are longer than their UTF-8 source.
    {
        const char* s = history[historyCount].text;
        char tmp[2060];
        char* d   = tmp;
        char* end = tmp + sizeof(tmp) - 10; // longest replacement is "Sterling"+null
        while (*s && d < end) {
            unsigned char c = (unsigned char)*s;
            if (c < 0x80) {
                *d++ = (char)c;
                s++;
                continue;
            }
            // Identify replacement string for common UTF-8 sequences
            char repBuf[2] = {'?', 0};
            const char* rep = repBuf;
            unsigned char b2 = (unsigned char)s[1];
            unsigned char b3 = (unsigned char)s[2];
            if (c == 0xC2) {
                // 2-byte U+00xx
                if      (b2 == 0xB0) rep = "deg";      // °
                else if (b2 == 0xA9) rep = "(C)";      // ©
                else if (b2 == 0xAE) rep = "(R)";      // ®
                else if (b2 == 0xA3) rep = "Sterling";  // £
                else if (b2 == 0xA5) rep = "Yen";      // ¥
                else if (b2 == 0xB5) rep = "mu";       // µ
                else if (b2 == 0xB1) rep = "+/-";      // ±
            } else if (c == 0xC3) {
                // Latin-1 Supplement → ASCII equivalents
                if      (b2 == 0x86)                rep = "AE"; // Æ
                else if (b2 == 0xA6)                rep = "ae"; // æ
                else if (b2 == 0x9F)                rep = "ss"; // ß
                else if (b2 == 0x9E)                rep = "Th"; // Þ
                else if (b2 == 0xBE)                rep = "th"; // þ
                else if (b2 == 0xB7)                rep = "/";  // ÷
                else if (b2 == 0x97)                rep = "x";  // ×
                else if (b2 >= 0x80 && b2 <= 0x85) rep = "A";  // À-Å
                else if (b2 == 0x87)                rep = "C";  // Ç
                else if (b2 >= 0x88 && b2 <= 0x8B) rep = "E";  // È-Ë
                else if (b2 >= 0x8C && b2 <= 0x8F) rep = "I";  // Ì-Ï
                else if (b2 == 0x90)                rep = "D";  // Ð
                else if (b2 == 0x91)                rep = "N";  // Ñ
                else if (b2 >= 0x92 && b2 <= 0x96) rep = "O";  // Ò-Ö
                else if (b2 == 0x98)                rep = "O";  // Ø
                else if (b2 >= 0x99 && b2 <= 0x9C) rep = "U";  // Ù-Ü
                else if (b2 == 0x9D)                rep = "Y";  // Ý
                else if (b2 >= 0xA0 && b2 <= 0xA5) rep = "a";  // à-å
                else if (b2 == 0xA7)                rep = "c";  // ç
                else if (b2 >= 0xA8 && b2 <= 0xAB) rep = "e";  // è-ë
                else if (b2 >= 0xAC && b2 <= 0xAF) rep = "i";  // ì-ï
                else if (b2 == 0xB0)                rep = "d";  // ð
                else if (b2 == 0xB1)                rep = "n";  // ñ
                else if (b2 >= 0xB2 && b2 <= 0xB6) rep = "o";  // ò-ö
                else if (b2 == 0xB8)                rep = "o";  // ø
                else if (b2 >= 0xB9 && b2 <= 0xBC) rep = "u";  // ù-ü
                else if (b2 == 0xBD || b2 == 0xBF) rep = "y";  // ý ÿ
            } else if (c == 0xC4 || c == 0xC5) {
                // Latin Extended-A (U+0100-U+017F) → base ASCII letter
                // 128-entry table indexed by (block_offset*64 + b2-0x80)
                static const char tbl[] =
                    "AaAaAaCcCcCcCcDdDdEeEeEeEeEeGgGgGgGgHhHhIiIiIiIiIiIiJjKkkLlLlLlL"
                    "lLlNnNnNnnNnOoOoOoOoRrRrRrSsSsSsSsTtTtTtUuUuUuUuUuUuWwYyYZzZzZzs";
                int idx = (c == 0xC5 ? 64 : 0) + (b2 - 0x80);
                if (b2 >= 0x80 && idx < 128) { repBuf[0] = tbl[idx]; rep = repBuf; }
            } else if (c == 0xCE) {
                if (b2 == 0xA9)      rep = "omega";    // Ω
            } else if (c == 0xCF) {
                if (b2 == 0x80)      rep = "pi";       // π
            } else if (c == 0xE2) {
                if (b2 == 0x80) {
                    if      (b3 == 0x98 || b3 == 0x99) rep = "'";   // curly single quotes
                    else if (b3 == 0x9C || b3 == 0x9D) rep = "\"";  // curly double quotes
                    else if (b3 == 0x91)                rep = "-";   // non-breaking hyphen
                    else if (b3 == 0x93 || b3 == 0x94) rep = "-";   // en/em dash
                    else if (b3 == 0xA6)                rep = "..."; // ellipsis
                    else if (b3 == 0xA2)                rep = "-";   // bullet
                } else if (b2 == 0x82 && b3 == 0xAC)   rep = "Euro"; // €
            }
            // Consume UTF-8 sequence (lead + continuation bytes)
            s++;
            while ((*s & 0xC0) == 0x80) s++;
            // Write replacement string
            while (*rep) *d++ = *rep++;
        }
        *d = '\0';
        strncpy(history[historyCount].text, tmp, 2047);
        history[historyCount].text[2047] = '\0';
    }
    historyCount++;
    scrollOffset = 0;   // auto-scroll to bottom
    rebuildLines();
    drawHistory();
}

// --- Touch coordinate mapping ---
// Raw XPT2046 range ~200–3900 → screen pixels
void mapTouch(TS_Point& tp, int& sx, int& sy) {
    sx = map(tp.x, calXmin, calXmax, 0, SCREEN_W - 1);
    sy = map(tp.y, calYmin, calYmax, 0, SCREEN_H - 1);
}

