alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Debounce ---
unsigned long lastTouchMs = 0;
#define TOUCH_DEBOUNCE_MS 125
#define SWIPE_THRESHOLD    15   // screen px of drag to register a scroll step

// --- Key hit-test helpers ---
bool inRect(int sx, int sy, int rx, int ry, int rw, int rh) {
    return sx >= rx && sx < rx + rw && sy >= ry && sy < ry + rh;
}

// Hit-test keyboard rows 0–3; flashes the key 100ms for feedback; returns string to append
String typeKBKey(int sx, int sy) {
    if (sy < KB_Y) return "";
    int rowStep = KEY_H + KEY_GAP;
    int rowIdx  = (sy - KB_Y) / rowStep;
    int rowY    = KB_Y + rowIdx * rowStep;
    if (sy >= rowY + KEY_H) return "";  // landed in gap between rows

    int    kx  = -1, x;
    String typed;
    char   lbl[3] = {0};  // ASCII display label for flash (max 2 chars)

    switch (rowIdx) {
        case 0: {  // number / symbol / alt row
            x = 0;
            for (int i = 0; i < 10; i++, x += KEY_W) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    if (altOn) {
                        typed = KB_NUM_ALT_TYPED[i];
                        strncpy(lbl, KB_NUM_ALT_DISP[i], 2); lbl[2] = '\0';
                    } else {
                        const char* nums = shiftOn ? KB_NUM_SHIFTED : KB_NUM_UNSHIFTED;
                        typed = String(nums[i]);
                        lbl[0] = nums[i]; lbl[1] = '\0';
                    }
                    kx = x; break;
                }
            }
            break;
        }
        case 1: {  // QWERTY
            x = 0;
            for (int i = 0; i < 10; i++, x += KEY_W) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW1[i] : (KB_ROW1[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            break;
        }
        case 2: {  // ASDFGHJKL + /
            x = 0;
            for (int i = 0; i < 9; i++, x += KEY_W) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW2[i] : (KB_ROW2[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            if (typed.length() == 0 && inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                const char* s = altOn ? "\\" : (shiftOn ? "?" : "/");
                typed = String(s); strncpy(lbl, s, sizeof(lbl) - 1); kx = x;
            }
            break;
        }
        case 3: {  // ZXCVBNM + ,.  (shifted: <>  alt: [])
            x = 0;
            for (int i = 0; i < 7; i++, x += KEY_W) {
                if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                    char c = shiftOn ? KB_ROW3[i] : (KB_ROW3[i] + 32);
                    typed = String(c); lbl[0] = c; lbl[1] = '\0'; kx = x; break;
                }
            }
            if (typed.length() == 0) {
                const char unshifted[] = { ',', '.' };
                const char shifted[]   = { '<', '>' };
                const char alt_ext[]   = { '[', ']' };
                const char* extras = altOn ? alt_ext : (shiftOn ? shifted : unshifted);
                for (int i = 0; i < 2; i++, x += KEY_W) {
                    if (inRect(sx, sy, x, rowY, KEY_W, KEY_H)) {
                        typed = String(extras[i]); lbl[0] = extras[i]; lbl[1] = '\0'; kx = x; break;
                    }
                }
            }
            break;
        }
        // case 4: Shift/Alt/Space/Hide/BS — handled in handleTouch()
    }

    if (kx >= 0 && typed.length() > 0) {
        drawKey(kx, rowY, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
        delay(KEY_FLASH_MS);
        drawKey(kx, rowY, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
    }
    return typed;
}

// Show keyboard and let user type a password. Returns typed string in out (64 bytes).
// Uses the existing keyboard (inputBuf/inputLen/shiftOn/altOn globals).
// Tap the input bar (Send button area) to submit.
void enterPassword(const char* ssidPrompt, char* out) {
    inputBuf[0] = '\0';
    inputLen    = 0;
    moreMode    = false;
    shiftOn     = false;
    altOn       = false;
    kbVisible   = true;

    tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
    tft.setTextFont(1);
    tft.setTextSize(1);
    tft.setTextColor(TFT_YELLOW, COL_BG);
    tft.setCursor(0, 0);  tft.print("Password for:");
    tft.setTextColor(TFT_WHITE,  COL_BG);
    tft.setCursor(0, 10); tft.print(ssidPrompt);
    drawInputBar();
    drawKeyboard();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Input bar tap → submit
        if (sy >= IBAR_Y_KB_SHOW && sy < IBAR_Y_KB_SHOW + IBAR_H_KB_SHOW) {
            strncpy(out, inputBuf, 63); out[63] = '\0';
            inputBuf[0] = '\0'; inputLen = 0;   // clear sensitive data
            return;
        }

        // Keyboard area
        if (sy >= KB_Y) {
            int bsY = SCREEN_H - BS_H;
            // BS key
            if (inRect(sx, sy, BS_X, bsY, BS_W, BS_H)) {
                drawKey(BS_X, bsY, BS_W, BS_H, "<-", TFT_WHITE, COL_BTN_TEXT);
                delay(KEY_FLASH_MS);
                drawKey(BS_X, bsY, BS_W, BS_H, "<-", COL_BTN_BG, COL_BTN_TEXT);
                if (inputLen > 0) { inputBuf[--inputLen] = '\0'; drawInputBar(); }
                continue;
            }
            // Row 4: Shift, Alt, Space (Hide ignored during password entry)
            int row4Y = KB_Y + 4 * (KEY_H + KEY_GAP) + 1;
            if (sy >= row4Y && sy < row4Y + KEY_H - 1) {
                if (inRect(sx, sy, SHIFT_X, row4Y, SHIFT_W, KEY_H - 1)) {
                    shiftOn = !shiftOn; altOn = false; drawKeyboard();
                } else if (inRect(sx, sy, ALT_X, row4Y, ALT_W, KEY_H - 1)) {
                    altOn = !altOn; shiftOn = false; drawKeyboard();
                } else if (inRect(sx, sy, SPACE_X, row4Y, SPACE_W, KEY_H - 1)) {
                    if (inputLen < 63) {
                        inputBuf[inputLen++] = ' '; inputBuf[inputLen] = '\0';
                        drawInputBar();
                    }
                }
                continue;
            }
            // Character keys
            String typed = typeKBKey(sx, sy);
            if (typed.length() > 0) {
                int addLen = typed.length();
                if (inputLen + addLen <= 63) {
                    memcpy(inputBuf + inputLen, typed.c_str(), addLen);
                    inputLen += addLen;
                    inputBuf[inputLen] = '\0';
                    drawInputBar();
                }
            }
        }
    }
}

