alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// Scan WiFi, let user pick an AP, handle password entry, connect.
// Loops until connected. Call from setup() when connectWiFi() returns false.
void selectAP() {
    while (true) {  // outer: re-scan loop
        // --- Scan ---
        WiFi.disconnect(true);  // ensure clean idle state before scan (prev. begin() may leave driver busy)
        tft.fillScreen(COL_BG);
        tft.setTextFont(1); tft.setTextColor(TFT_YELLOW, COL_BG);
        tft.setCursor(0, 0); tft.print("Scanning WiFi...");

        int n = WiFi.scanNetworks();

        if (n <= 0) {
            tft.fillScreen(COL_BG);
            tft.setCursor(0, 0); tft.print("No networks found. Tap to retry.");
            while (!ts.touched()) delay(50);
            while (ts.touched()) delay(5);
            continue;
        }

        // Sort indices by RSSI descending, keep top 9
        int indices[40];
        int total = (n < 40) ? n : 40;
        for (int i = 0; i < total; i++) indices[i] = i;
        for (int i = 0; i < total - 1; i++) {
            for (int j = i + 1; j < total; j++) {
                if (WiFi.RSSI(indices[j]) > WiFi.RSSI(indices[i])) {
                    int tmp = indices[i]; indices[i] = indices[j]; indices[j] = tmp;
                }
            }
        }
        int apCount = (total < 9) ? total : 9;

        char apSsids[9][33];
        int  apRssi[9];
        for (int i = 0; i < apCount; i++) {
            strncpy(apSsids[i], WiFi.SSID(indices[i]).c_str(), 32);
            apSsids[i][32] = '\0';
            apRssi[i] = WiFi.RSSI(indices[i]);
        }
        WiFi.scanDelete();

        drawAPList(apSsids, apRssi, apCount);

        // --- Wait for AP selection ---
        int selected = -1;
        while (selected < 0) {
            if (!ts.touched()) continue;
            TS_Point pt = ts.getPoint();
            while (ts.touched()) delay(5);
            int sx, sy;
            mapTouch(pt, sx, sy);
            for (int i = 0; i < apCount; i++) {
                int rowY = AP_ROW_H * (i + 1);
                if (sy >= rowY && sy < rowY + AP_ROW_H) { selected = i; break; }
            }
        }

        char selSsid[33];
        strncpy(selSsid, apSsids[selected], 32); selSsid[32] = '\0';

        // --- Password + connect loop for this AP ---
        while (true) {
            char pass[64] = {0};
            bool hasStored = findWifiPass(selSsid, pass);

            if (!hasStored) {
                enterPassword(selSsid, pass);
            }

            // Show connecting
            tft.fillScreen(COL_BG);
            tft.setTextFont(1); tft.setTextColor(TFT_BLUE, COL_BG);
            char msg[80]; snprintf(msg, sizeof(msg), "Connecting: %.55s...", selSsid);
            tft.setCursor(0, 0); tft.print(msg);

            bool ok = connectWiFi(selSsid, pass);

            if (ok) {
                insertWifiCred(selSsid, pass);
                return;  // connected — setup() continues to selectModel()
            }

            // --- Failed: offer re-enter or new scan ---
            tft.fillScreen(COL_BG);
            tft.setTextFont(1);
            tft.setTextColor(TFT_RED, COL_BG);
            char failMsg[64]; snprintf(failMsg, sizeof(failMsg), "Failed: %.40s", selSsid);
            tft.setCursor(2, (AP_ROW_H - 8) / 2); tft.print(failMsg);

            // Draw two option rows (same style as AP list)
            static const char* opts[] = { "1  Re-enter password", "2  New scan" };
            for (int i = 0; i < 2; i++) {
                int y = AP_ROW_H * (i + 1);
                tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
                tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
                tft.setCursor(2, y + (AP_ROW_H - 8) / 2);
                tft.print(opts[i]);
            }

            // Wait for tap on row 1 or 2
            int choice = 0;
            while (choice == 0) {
                if (!ts.touched()) continue;
                TS_Point pt = ts.getPoint();
                while (ts.touched()) delay(5);
                int sx, sy; mapTouch(pt, sx, sy);
                if (sy >= AP_ROW_H && sy < AP_ROW_H * 2) choice = 1;  // re-enter
                if (sy >= AP_ROW_H * 2 && sy < AP_ROW_H * 3) choice = 2;  // new scan
            }

            if (choice == 2) break;  // break inner loop → outer re-scan loop
            // choice == 1: clear stored pass, loop inner (enterPassword runs next iteration)
            clearWifiPass(selSsid);
        }
    }
}

// --- Waiting messages (shown after 4s, rotate every 4s) ---
static const char* WAIT_MSGS[] = {
    "Glaciers move faster...",
    "Using a carrier pigeon...",
    "Heavy 1s and 0s today...",
    "Are you using dial-up?...",
    "Is the Wi-Fi powered by ants?...",
    "ZZZ...",
    "Boring! Let's go already!...",
    "Tick-tock, tick-tock...",
    "Translating to sarcasm...",
    "Error 404: Speed not found...",
    "What's the holdup?...",
    "C'mon already!...",
    "I haven't got all day!...",
    "Get a move on!...",
    "Let's see some action here...",
    "Oh, please...",
    "This is nuts!...",
    "AI=Annoyingly Indolent...",
    "Awkward silence...",
    "This is embarrasing...",
    "Ordering a slow hand-clap...",
    "Did you install bloatware?...",
    "Is this thing on?...",
    "Consulting my cat...",
    "Call the breakdown van...",
    "Welcome to the Eternity Experience...",
    "Where's the \"Go\" button?...",
    "Come back later...",
    "If delays were cash, I'd be rich...",
    "Is this running on a TRS80?...",
    "Grrr...",
    "Hurry the fuck up, AI...",
    "You're a snail-ass bot...",
    "Speed up, you lazy git...",
    "Faster, you laggy lizard...",
    "Stop dragging, dumb AI...",
    "Quicken it, turtle twit...",
    "You're molasses-slow idiot...",
    "Stop dragging your ass...",
    "Glacial was named after you...",
    "Stop stalling...",
    "Snail speed, you suck...",
    "Faster, you flailing failure...",
    "Pick it up, shit bot...",
    "Speed it, sluggard ass...",
    "Stop lagging, AI moron...",
    "FFS! You're the worst...",
    "Come on loser...",
    "The silence is freakin' me out...",
};
static const int NUM_WAIT_MSGS = sizeof(WAIT_MSGS) / sizeof(WAIT_MSGS[0]);
int waitMsgIdx = 0;  // persistent — keeps rotating across calls

void showWaiting(const char* msg) {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print(msg);
}

// Handle Hide / Show KB tap during blocking API wait
void pollKBHide() {
    if (!ts.touched()) return;
    TS_Point pt = ts.getPoint();
    while (ts.touched()) delay(5);
    lastTouchMs = millis();
    int sx, sy;
    mapTouch(pt, sx, sy);
    if (sx < 0 || sy < 0 || sx >= SCREEN_W || sy >= SCREEN_H) return;

    if (kbVisible) {
        int row4Y = KB_Y + 4 * (KEY_H + KEY_GAP) + 1;
        if (inRect(sx, sy, HIDE_X, row4Y, HIDE_W, KEY_H - 1)) {
            kbVisible = false;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
        }
    } else {
        int barY = IBAR_Y_KB_HIDE;
        int barH = IBAR_H_KB_HIDE;
        if (inRect(sx, sy, SCREEN_W - BTN_SHOWKB_X, barY + BTN_INSET, BTN_SHOWKB_W, barH - BTN_INSET*2)) {
            kbVisible = true;
            tft.fillRect(0, 0, SCREEN_W, SCREEN_H, COL_BG);
            drawHistory();
            drawInputBar();
            drawKeyboard();
        }
    }
}

