alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Gemini API call ---
String callGemini(const char* prompt) {
    // Build JSON body
    JsonDocument reqDoc;
    JsonObject sysInstr = reqDoc["system_instruction"].to<JsonObject>();
    JsonArray  sysParts = sysInstr["parts"].to<JsonArray>();
    JsonObject sysPart  = sysParts.add<JsonObject>();
    sysPart["text"]     = "Respond in 150 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols. Use paragraphs to separate distinct ideas. Never include URLs or hyperlinks. When quoting current or time-sensitive information, use your search tool to check live sources first.";

    JsonArray contents = reqDoc["contents"].to<JsonArray>();

    // Add conversation history (exclude the final entry — that IS the current prompt,
    // already appended to history[] by addMessage() in sendPrompt before this call)
    for (int i = 0; i < historyCount - 1; i++) {
        JsonObject msg  = contents.add<JsonObject>();
        msg["role"]     = history[i].isUser ? "user" : "model";
        JsonArray parts = msg["parts"].to<JsonArray>();
        JsonObject part = parts.add<JsonObject>();
        part["text"]    = history[i].text;
    }

    // Add current prompt (sent once only)
    JsonObject curMsg  = contents.add<JsonObject>();
    curMsg["role"]     = "user";
    JsonArray curParts = curMsg["parts"].to<JsonArray>();
    JsonObject curPart = curParts.add<JsonObject>();
    curPart["text"]    = prompt;

    // Enable Google Search grounding so the model can retrieve live web results
    JsonArray tools = reqDoc["tools"].to<JsonArray>();
    tools.add<JsonObject>()["google_search"].to<JsonObject>();

    String body;
    serializeJson(reqDoc, body);

    // Build URL path with API key
    char path[256];
    snprintf(path, sizeof(path),
        "/v1beta/models/%s:generateContent?key=%s",
        GEMINI_MODEL, GEMINI_API_KEY);

    // Reconnect WiFi if dropped
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);   // 45s TLS timeout (pro model needs longer)

    if (!client.connect(GEMINI_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    client.printf(
        "POST %s HTTP/1.0\r\n"
        "Host: " GEMINI_HOST "\r\n"
        "Content-Type: application/json\r\n"
        "Content-Length: %d\r\n\r\n",
        path, (int)body.length());
    client.print(body);

    // Read full response — drain available() buffer even after SSL close_notify
    // marks connection closed (readString() stops too early in that case)
    String fullResp = "";
    unsigned long deadline   = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs  = millis() + API_WAIT_FIRST_MS;  // first message swap after 4s
    while (millis() < deadline) {
        while (client.available()) {
            fullResp += (char)client.read();
        }
        if (!client.connected() && !client.available()) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 4000;
        }
        pollKBHide();
        delay(10);
    }
    client.stop();
    Serial.printf("[Gemini] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Extract HTTP status code
    int httpStatus = 200;
    int statusPos = fullResp.indexOf("HTTP/");
    if (statusPos >= 0) {
        int eol = fullResp.indexOf('\n', statusPos);
        sscanf(fullResp.substring(statusPos, eol).c_str(), "HTTP/%*s %d", &httpStatus);
    }

    // Locate JSON body — starts at first '{'
    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) {
        char buf[40]; snprintf(buf, sizeof(buf), "ERR: HTTP %d, no JSON", httpStatus);
        return String(buf);
    }
    String respBody = fullResp.substring(jsonStart);

    // Parse JSON — success if candidates present, error if error.message present
    JsonDocument respDoc;
    if (deserializeJson(respDoc, respBody) != DeserializationError::Ok) {
        Serial.println("Bad JSON (HTTP " + String(httpStatus) + "): " + respBody.substring(0, 300));
        char buf[40]; snprintf(buf, sizeof(buf), "ERR: HTTP %d, bad JSON", httpStatus);
        return String(buf);
    }

    // Check for API error
    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    const char* text = respDoc["candidates"][0]["content"]["parts"][0]["text"];
    if (!text) return "ERR: no text in response";

    return String(text);
}

// --- Grok API call (xAI /v1/responses + web_search tool) ---
String callGrok(const char* prompt) {
    // /v1/responses uses "input" array and top-level "instructions" for system prompt
    JsonDocument reqDoc;
    reqDoc["model"]        = GROK_MODEL;
    reqDoc["stream"]       = false;
    reqDoc["instructions"] = "Respond in 150 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols, no numbered or unnumbered lists. Use paragraphs to separate distinct ideas. Never include URLs, hyperlinks, citations, footnotes, source references, or attribution of any kind. Do not mention where information came from. When quoting current or time-sensitive information, use your web search tool to check live sources first.";

    JsonArray input = reqDoc["input"].to<JsonArray>();

    // Conversation history (exclude last entry — that is the current prompt)
    for (int i = 0; i < historyCount - 1; i++) {
        JsonObject msg  = input.add<JsonObject>();
        msg["role"]     = history[i].isUser ? "user" : "assistant";
        msg["content"]  = history[i].text;
    }

    // Current prompt
    JsonObject curMsg  = input.add<JsonObject>();
    curMsg["role"]     = "user";
    curMsg["content"]  = prompt;

    // Enable live web search
    JsonArray tools = reqDoc["tools"].to<JsonArray>();
    tools.add<JsonObject>()["type"] = "web_search";

    String body;
    serializeJson(reqDoc, body);

