alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    if (!client.connect(GROK_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    client.printf(
        "POST /v1/responses HTTP/1.0\r\n"
        "Host: " GROK_HOST "\r\n"
        "Content-Type: application/json\r\n"
        "Authorization: Bearer %s\r\n"
        "Content-Length: %d\r\n\r\n",
        GROK_API_KEY, (int)body.length());
    client.print(body);

    String fullResp = "";
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    while (millis() < deadline) {
        while (client.available()) {
            fullResp += (char)client.read();
        }
        if (!client.connected() && !client.available()) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
        pollKBHide();
        delay(10);
    }
    client.stop();
    Serial.printf("[Grok] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    String respBody = fullResp.substring(jsonStart);
    Serial.println("[Grok] JSON body: " + respBody.substring(0, 400));

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    JsonDocument respDoc;
    if (deserializeJson(respDoc, respBody) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + respBody.substring(0, 200));
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // /v1/responses: output[] → find type=="message" → content[0]["text"]
    JsonArray output = respDoc["output"].as<JsonArray>();
    for (JsonObject item : output) {
        const char* type = item["type"];
        if (type && strcmp(type, "message") == 0) {
            const char* text = item["content"][0]["text"];
            if (text) {
                // Strip Grok citations. Format is [[3]](url) (markdown link
                // where link text is [3]). Also handles bare [3] fallback.
                String out;
                out.reserve(strlen(text));
                const char* p = text;
                while (*p) {
                    if (*p == '[') {
                        // Try [[n]](url) — full Grok markdown citation
                        if (*(p+1) == '[') {
                            const char* q = p + 2;
                            while (*q && *q != ']') q++;
                            if (*q == ']' && *(q+1) == ']' && *(q+2) == '(') {
                                bool ok = (q > p + 2);
                                for (const char* c = p+2; ok && c < q; c++)
                                    if (*c != ',' && (*c < '0' || *c > '9')) ok = false;
                                if (ok) {
                                    const char* r = q + 3; // skip past ]](
                                    while (*r && *r != ')') r++;
                                    if (*r == ')') { p = r + 1; continue; }
                                }
                            }
                        }
                        // Try bare [n] citation marker
                        const char* q = p + 1;
                        while (*q && *q != ']') q++;
                        if (*q == ']') {
                            bool ok = (q > p + 1);
                            for (const char* c = p+1; ok && c < q; c++)
                                if (*c != ',' && (*c < '0' || *c > '9')) ok = false;
                            if (ok) { p = q + 1; continue; }
                        }
                    }
                    out += *p++;
                }
                return out;
            }
        }
    }

    return "ERR: no text in response";
}

String callGroq(const char* prompt) {
    // Groq: OpenAI-compatible /openai/v1/chat/completions
    JsonDocument reqDoc;
    reqDoc["model"]  = GROQ_MODEL;
    reqDoc["stream"] = false;

    JsonArray messages = reqDoc["messages"].to<JsonArray>();

    // System prompt
    JsonObject sysMsgObj = messages.add<JsonObject>();
    sysMsgObj["role"]    = "system";
    sysMsgObj["content"] = "Respond in 150 words or fewer. Plain text only: no markdown, no ** or * emphasis, no tables, no bullet symbols, no numbered or unnumbered lists. Use paragraphs to separate distinct ideas. Never include URLs, hyperlinks, citations, footnotes, source references, or attribution of any kind.";

    // Conversation history (exclude last entry — current prompt)
    for (int i = 0; i < historyCount - 1; i++) {
        JsonObject msg  = messages.add<JsonObject>();
        msg["role"]     = history[i].isUser ? "user" : "assistant";
        msg["content"]  = history[i].text;
    }

    // Current prompt
    JsonObject curMsg  = messages.add<JsonObject>();
    curMsg["role"]     = "user";
    curMsg["content"]  = prompt;

    String body;
    serializeJson(reqDoc, body);

    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    if (!client.connect(GROQ_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    client.printf(
        "POST /openai/v1/chat/completions HTTP/1.0\r\n"
        "Host: " GROQ_HOST "\r\n"
        "Content-Type: application/json\r\n"
        "Authorization: Bearer %s\r\n"
        "Content-Length: %d\r\n\r\n",
        GROQ_API_KEY, (int)body.length());
    client.print(body);

    String fullResp = "";
    unsigned long deadline  = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs = millis() + API_WAIT_FIRST_MS;
    while (millis() < deadline) {
        while (client.available()) {
            fullResp += (char)client.read();
        }
        if (!client.connected() && !client.available()) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 6000;
        }
        pollKBHide();
        delay(10);
    }
    client.stop();
    Serial.printf("[Groq] response len=%d\n", fullResp.length());

