alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
    if (fullResp.length() == 0) return "ERR: empty response";

    // Parse HTTP status
    int httpStatus = 200;
    if (fullResp.startsWith("HTTP/")) {
        int sp = fullResp.indexOf(' ');
        if (sp > 0) httpStatus = fullResp.substring(sp + 1, sp + 4).toInt();
    }

    int jsonStart = fullResp.indexOf('{');
    if (jsonStart < 0) return "ERR: no JSON in response";
    String respBody = fullResp.substring(jsonStart);
    Serial.println("[Groq] JSON body: " + respBody.substring(0, 400));

    if (httpStatus != 200) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: HTTP %d (see serial)", httpStatus);
        return String(buf);
    }

    JsonDocument respDoc;
    if (deserializeJson(respDoc, respBody) != DeserializationError::Ok) {
        Serial.println("Bad JSON: " + respBody.substring(0, 200));
        return "ERR: JSON parse failed";
    }

    const char* errMsg = respDoc["error"]["message"];
    if (errMsg) {
        char buf[80];
        snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
        return String(buf);
    }

    // OpenAI-compatible: choices[0].message.content
    const char* text = respDoc["choices"][0]["message"]["content"];
    if (text) return String(text);

    return "ERR: no text in response";
}

// --- Send flow ---
void showThinking() {
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;
    tft.fillRect(0, barY, SCREEN_W - BTN_SEND_W, barH, COL_IBAR_BG);
    tft.setTextColor(TFT_DARKGREY, COL_IBAR_BG);
    tft.setTextSize(1);
    tft.setCursor(2, barY + (barH - 8) / 2);
    tft.print("Thinking...");
}

void sendPrompt() {
    char prompt[128];
    if (inputLen == 0) {
        if (!moreMode) return;  // nothing typed and no AI reply yet — ignore tap
        strncpy(prompt, "Tell me more.", 127);
    } else {
        strncpy(prompt, inputBuf, 127);
        inputBuf[0] = '\0';
        inputLen    = 0;
    }
    prompt[127] = '\0';
    moreMode = false;
    kbVisible = false;   // hide KB; drawHistory() covers the KB area
    drawInputBar();      // clear full bar now — erases BS/Hide key remnants before API wait

    // Show user message and thinking indicator
    addMessage(true, false, prompt);
    showThinking();

    // Call API
    String response = useGroq ? callGroq(prompt) : (useGrok ? callGrok(prompt) : callGemini(prompt));

    if (response.startsWith("ERR:")) {
        addMessage(false, true, response.c_str());
    } else {
        addMessage(false, false, response.c_str());
    }

    moreMode = true;   // after every reply, offer "More"
    wifiHealthy = (WiFi.status() == WL_CONNECTED);  // refresh after API call; LED uses RSSI independently
    drawInputBar();
}

void drawCrosshair(int x, int y) {
    tft.drawLine(x - 18, y, x + 18, y, TFT_WHITE);
    tft.drawLine(x, y - 18, x, y + 18, TFT_WHITE);
    tft.drawCircle(x, y, 6, TFT_WHITE);
}

void calibrateTouch() {
    const int T1X = 20,           T1Y = 20;
    const int T2X = SCREEN_W - 20, T2Y = SCREEN_H - 20;

    tft.fillScreen(COL_BG);
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, COL_BG);

    // Flush any spurious touches
    while (ts.touched()) delay(5);
    delay(200);

    // --- Point 1: top-left ---
    drawCrosshair(T1X, T1Y);
    tft.setCursor(60, 110); tft.print("Tap the crosshair");

    while (!ts.touched()) delay(5);
    long sumX = 0, sumY = 0; int n = 0;
    while (ts.touched()) {
        TS_Point p = ts.getPoint();
        sumX += p.x; sumY += p.y; n++;
        delay(5);
    }
    int rx1 = sumX / n, ry1 = sumY / n;

    // --- Point 2: bottom-right ---
    tft.fillScreen(COL_BG);
    drawCrosshair(T2X, T2Y);
    tft.setCursor(60, 110); tft.print("Tap the crosshair");

    delay(300);
    while (!ts.touched()) delay(5);
    sumX = 0; sumY = 0; n = 0;
    while (ts.touched()) {
        TS_Point p = ts.getPoint();
        sumX += p.x; sumY += p.y; n++;
        delay(5);
    }
    int rx2 = sumX / n, ry2 = sumY / n;

    // Extrapolate raw values to screen edges (0 and SCREEN_W/H - 1)
    long dRx = rx2 - rx1, dTx = T2X - T1X;
    long dRy = ry2 - ry1, dTy = T2Y - T1Y;
    calXmin = (int)(rx1 - dRx * T1X / dTx);
    calXmax = (int)(rx2 + dRx * (SCREEN_W - 1 - T2X) / dTx);
    calYmin = (int)(ry1 - dRy * T1Y / dTy);
    calYmax = (int)(ry2 + dRy * (SCREEN_H - 1 - T2Y) / dTy);

    saveTouchCal();
    Serial.printf("[Cal] xmin=%d xmax=%d ymin=%d ymax=%d\n", calXmin, calXmax, calYmin, calYmax);

    tft.fillScreen(COL_BG);
    tft.setTextColor(TFT_GREEN, COL_BG);
    tft.setCursor(60, 110); tft.print("Calibration saved!");
    delay(1500);
}

void showModelChoices() {
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, COL_BG);
    tft.setCursor(0, 30); tft.print("Hit 1 for Gemini 2.5 Flash");
    tft.setCursor(0, 40); tft.print("    2 for Gemini 3 Flash");
    tft.setCursor(0, 50); tft.print("    3 for Gemini 3.1 Pro");
    tft.setCursor(0, 60); tft.print("    4 for Grok 4.1 Fast Reasoning");
    tft.setCursor(0, 70); tft.print("    5 for Groq GPT-OSS-120b");
    int nextY = 80;
    if (!largeFont) {
        tft.setCursor(0, nextY); tft.print("    b for bigger font");
        nextY += 10;
    }
    if (!invertDisplay) {
        tft.setCursor(0, nextY); tft.print("    i  to invert colours");
        nextY += 10;
    }
    tft.setCursor(0, nextY); tft.print("    c  to calibrate touch");
}

void selectModel() {
    static const char* modelIds[]    = {
        "gemini-2.5-flash",
        "gemini-3-flash-preview",
        "gemini-3.1-pro-preview"
    };
    static const bool  modelGlobal[] = { true, true, false };

    showModelChoices();

    while (true) {
        if (!ts.touched()) continue;
        TS_Point pt = ts.getPoint();
        while (ts.touched()) delay(5);
        int sx, sy;
        mapTouch(pt, sx, sy);

        // Hit-test keys 1, 2, 3 (Gemini models)
        int x = 0;
        for (int i = 0; i < 3; i++, x += KEY_W) {
            if (inRect(sx, sy, x, KB_Y, KEY_W, KEY_H)) {
                char lbl[2] = { char('1' + i), '\0' };
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(x, KB_Y, KEY_W, KEY_H, lbl, COL_KEY_FACE, COL_KEY_LABEL);
                strncpy(GEMINI_MODEL, modelIds[i], 47);
                GEMINI_MODEL[47] = '\0';
                geminiUseGlobal  = modelGlobal[i];
                useGrok          = false;
                useGroq          = false;
                uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
                if (largeFont) {
                    tft.setFreeFont(&DejaVuSansBold12px);
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.drawString("CYD AI chatbot", 0, 0);
                    tft.drawString(GEMINI_MODEL, 0, LINE_H_LARGE);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                    tft.setTextFont(1);
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_GREEN, bg);
                    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                    tft.setCursor(0, 10); tft.print("Model: "); tft.print(GEMINI_MODEL);
                    tft.setTextColor(TFT_DARKGREY, bg);
                    tft.setCursor(0, 20); tft.print("Ready.");
                }
                return;
            }
        }

        // Key 4 — Grok 4.1 Fast
        int x4 = 3 * KEY_W;
        if (inRect(sx, sy, x4, KB_Y, KEY_W, KEY_H)) {
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", TFT_WHITE, COL_BG);
            delay(KEY_FLASH_MS);
            drawKey(x4, KB_Y, KEY_W, KEY_H, "4", COL_KEY_FACE, COL_KEY_LABEL);
            useGrok = true;
            useGroq = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                tft.setFreeFont(&DejaVuSansBold12px);
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("CYD AI chatbot", 0, 0);
                tft.drawString("Grok 4.1 Fast", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                tft.setTextFont(1);
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                tft.setCursor(0, 10); tft.print("Model: Grok 4.1 Fast");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }

        // Key 5 — Groq GPT-OSS-120b
        int x5 = 4 * KEY_W;
        if (inRect(sx, sy, x5, KB_Y, KEY_W, KEY_H)) {
            drawKey(x5, KB_Y, KEY_W, KEY_H, "5", TFT_WHITE, COL_BG);
            delay(KEY_FLASH_MS);
            drawKey(x5, KB_Y, KEY_W, KEY_H, "5", COL_KEY_FACE, COL_KEY_LABEL);
            useGroq = true;
            useGrok = false;
            uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
            tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, bg);
            if (largeFont) {
                tft.setFreeFont(&DejaVuSansBold12px);
                tft.setTextColor(TFT_GREEN, bg);
                tft.drawString("CYD AI chatbot", 0, 0);
                tft.drawString("Groq GPT-OSS-120b", 0, LINE_H_LARGE);
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.drawString("Ready.", 0, 2 * LINE_H_LARGE);
                tft.setTextFont(1);
            } else {
                tft.setTextSize(1);
                tft.setTextColor(TFT_GREEN, bg);
                tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                tft.setCursor(0, 10); tft.print("Model: Groq GPT-OSS-120b");
                tft.setTextColor(TFT_DARKGREY, bg);
                tft.setCursor(0, 20); tft.print("Ready.");
            }
            return;
        }

        // Key B (ZXCVBNM row, index 4) — toggle large text, re-show choices
        if (!largeFont) {
            int rowStep = KEY_H + KEY_GAP;
            int row3Y   = KB_Y + 3 * rowStep;
            int xb      = 4 * KEY_W;
            if (inRect(sx, sy, xb, row3Y, KEY_W, KEY_H)) {
                drawKey(xb, row3Y, KEY_W, KEY_H, "B", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xb, row3Y, KEY_W, KEY_H, "b", COL_KEY_FACE, COL_KEY_LABEL);
                largeFont = true;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                tft.setFreeFont(&DejaVuSansBold12px);
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.drawString("CYD AI chatbot. Large text.", 0, 0);
                tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                tft.setTextFont(1);
                showModelChoices();
            }
        }

        // Key I (QWERTY row, index 7) — toggle invert colours, re-show choices
        {
            int rowStep = KEY_H + KEY_GAP;
            int row1Y   = KB_Y + rowStep;
            int xi      = 7 * KEY_W;
            if (inRect(sx, sy, xi, row1Y, KEY_W, KEY_H)) {
                drawKey(xi, row1Y, KEY_W, KEY_H, "I", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xi, row1Y, KEY_W, KEY_H, "i", COL_KEY_FACE, COL_KEY_LABEL);
                invertDisplay = !invertDisplay;
                tft.fillRect(0, 0, SCREEN_W, HIST_H_KB_SHOW, COL_BG);
                if (largeFont) {
                    tft.setFreeFont(&DejaVuSansBold12px);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.drawString("CYD AI chatbot. Large text.", 0, 0);
                    tft.drawString("Select AI model:", 0, LINE_H_LARGE);
                    tft.setTextFont(1);
                } else {
                    tft.setTextSize(1);
                    tft.setTextColor(TFT_DARKGREY, COL_BG);
                    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
                }
                showModelChoices();
            }
        }

        // Key C (ZXCVBNM row, index 2) — touch calibration
        {
            int rowStep = KEY_H + KEY_GAP;
            int row3Y   = KB_Y + 3 * rowStep;
            int xc      = 2 * KEY_W;
            if (inRect(sx, sy, xc, row3Y, KEY_W, KEY_H)) {
                drawKey(xc, row3Y, KEY_W, KEY_H, "C", TFT_WHITE, COL_BG);
                delay(KEY_FLASH_MS);
                drawKey(xc, row3Y, KEY_W, KEY_H, "c", COL_KEY_FACE, COL_KEY_LABEL);
                calibrateTouch();
                tft.fillScreen(COL_BG);
                tft.setTextSize(1);
                tft.setTextColor(TFT_DARKGREY, COL_BG);
                tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
                tft.setCursor(0, 10); tft.print("Ready. Select AI model:");
                drawKeyboard();
                drawInputBar();
                showModelChoices();
            }
        }
    }
}

void setup() {
    loadWifiCreds();   // load NVS; shows AP picker on first boot if no credentials stored
    loadTouchCal();    // load saved touch calibration from NVS (or keep defaults)

    // Hold BOOT button (GPIO0) on power-on to wipe touch calibration back to defaults
    pinMode(0, INPUT_PULLUP);
    if (digitalRead(0) == LOW) {
        Preferences p;
        p.begin("touch", false);
        p.remove("valid");
        p.remove("orient");
        p.end();
        calXmin = 200; calXmax = 3900; calYmin = 200; calYmax = 3900;
        Serial.begin(115200);
        Serial.println("[Cal] Reset to defaults via BOOT button");
        delay(500);
    }
    Serial.begin(115200);
    Serial.printf("[Cal] xmin=%d xmax=%d ymin=%d ymax=%d\n", calXmin, calXmax, calYmin, calYmax);
    waitMsgIdx = random(NUM_WAIT_MSGS);

    // Display (init before backlight to avoid white flash)
    tft.init();
#ifdef ROTATE_180
    tft.setRotation(3);
#else
    tft.setRotation(1);
#endif
    tft.fillScreen(COL_BG);

    // Backlight on after screen is ready
    pinMode(TFT_BL, OUTPUT);
    digitalWrite(TFT_BL, HIGH);

    // Touch
    touchSPI.begin(TOUCH_SCLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS_PIN);
    ts.begin(touchSPI);
#ifdef ROTATE_180
    ts.setRotation(3);  // 180°: xraw = 4095-x, yraw = 4095-y; keeps same cal defaults (200/3900)
#else
    ts.setRotation(1);  // landscape USB-right: xraw = x, yraw = y
#endif

    // Drain spurious startup touch
    unsigned long t0 = millis();
    while (ts.touched() && millis() - t0 < 500) delay(10);

    setupRGBLed();

    drawKeyboard();
    drawInputBar();
    bool wifiOk = connectWiFi(wifiSsid[0], wifiPass[0], true);
    if (!wifiOk) {
        selectAP();  // scan → pick AP → enter password → connect; returns only on success
        drawKeyboard();   // selectAP() wiped the screen; restore before selectModel()
        drawInputBar();
    }

    // Startup help — drawn directly in history area; cleared on first chat message
    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY, COL_BG);
    tft.setCursor(0,  0); tft.print("CYD AI chatbot. Swipe down for older chat.");
    tft.setCursor(0, 10); tft.print("Ready. Select AI model:");

    selectModel();  // draws choices at y=30+ and waits for 1/2/3
}

void checkWiFiHealth() {
    updateLedWifi();  // instant — runs every loop, LED reacts immediately to dropout

    if (millis() - lastWiFiCheckMs < 3000) return;
    lastWiFiCheckMs = millis();

    bool ok = (WiFi.status() == WL_CONNECTED) && Ping.ping(IPAddress(8,8,8,8), 1);

    if (ok != wifiHealthy) {
        wifiHealthy = ok;
        drawInputBar();  // '>' and Send/More turn red on fail, white on recovery
    }

    if (!ok) {
        // Reconnect in background — status checked on next 10s tick
        WiFi.disconnect(false);
        WiFi.begin(wifiSsid[0], wifiPass[0]);
    }
}

void loop() {
    handleTouch();
    checkWiFiHealth();
}
